app/controllers/home_controller.rb

  def index

      @recipes = Recipe.all
---
SELECT "recipes".* FROM "recipes"