app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @recipe = Recipe.find(params[:id])